Revit 2026 API

# XYZIsZeroLength Method

---

The boolean value that indicates whether this vector is a zero vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsZeroLength()
```
```vb
Public Function IsZeroLength As Boolean
```
```cpp
public:
bool IsZeroLength()
```
```fsharp
member IsZeroLength : unit -> bool
```

#### Return Value

Boolean

The zero vector's each component is zero within the tolerance (1.0e-09).

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace